app/Models/Courses.php

SELECT *
FROM `Course`
---
        public function getCourse(){

            $Course = $this->db->table('Course');


            return $Course->get()->getResultArray();

SELECT *
FROM `file`
JOIN `course_file` ON `course_file`.`id_file` = `file`.`id_file`
JOIN `course` ON `course`.`id_course` = `course_file`.`id_course`
WHERE `course`.`id_course` = ('1')
---
        public function getCourseVideos($id_course){
            $File = $this->db->table('file');
            $File->join('course_file', 'course_file.id_file = file.id_file');
            $File->join('course', 'course.id_course = course_file.id_course');
            $File->where('course.id_course', $id_course);

            //var_dump($File->get()->getResultArray());

            return $File->get()->getResultArray();

SELECT *
FROM `file`
JOIN `course_file` ON `course_file`.`id_file` = `file`.`id_file`
JOIN `course` ON `course`.`id_course` = `course_file`.`id_course`
WHERE `file`.`id_file` = ('3')
---
        public function getCourseVideoOnly($id_file){
            $File = $this->db->table('file');
            $File->join('course_file', 'course_file.id_file = file.id_file');
            $File->join('course', 'course.id_course = course_file.id_course');
            $File->where('file.id_file', $id_file);

            //var_dump($File->get()->getResultArray());

            return $File->get()->getResultArray();