app/Models/Users.php

SELECT *
FROM `users`
JOIN `person` ON `users`.`id_person` = `person`.`id_person`
WHERE `user` = 'admin'
---
        public function getUsers($data){

            $Usuario = $this->db->table('users');
            $Usuario->join('person', 'users.id_person = person.id_person');
            $Usuario->where($data);
            //var_dump($Usuario->get()->getResultArray());

            return $Usuario->get()->getResultArray();